In [1]:
import mysql.connector

In [2]:
conn = mysql.connector.connect(host="localhost",user="root",passwd="OmSql@123",database="mydb")

In [3]:
cur = conn.cursor()

In [4]:
employee_db = cur.execute("create table emp_details(e_id int primary key, name varchar(20), Salary int,experiennce int)")

In [5]:
cur.execute("select * from emp_details")

result = cur.fetchall()

for x in result:
    print(x)

(1, 'Om', 55000, 22)
(2, 'Vivek', 48000, 18)
(3, 'Neel', 35000, 4)
(4, 'Varun', 60000, 25)
(5, 'Shubham', 28000, 2)
(6, 'Ruthwik', 45000, 12)
(7, 'Rohan', 38000, 6)

## Create a Python program to increase the salary of employee by 10% those who have working experience more than 20 years. Assume suitable table structure.

In [6]:
cur.execute("update emp_details set salary = (salary + salary * 0.10) where experiennce > 20")
conn.commit()

In [7]:
cur.execute("select * from emp_details")

result = cur.fetchall()

for x in result:
    print(x)

(1, 'Om', 60500, 22)
(2, 'Vivek', 48000, 18)
(3, 'Neel', 35000, 4)
(4, 'Varun', 66000, 25)
(5, 'Shubham', 28000, 2)
(6, 'Ruthwik', 45000, 12)
(7, 'Rohan', 38000, 6)

## Create a Python program to display the names of employees who have more than 15 years of experience and salary greater than 50,000 (eligible for promotion). Assume suitable table structure.

In [15]:
cur.execute("select name from emp_details where experiennce > 15 AND salary > 50000")

In [16]:
result = cur.fetchall()

for x in result:
    print(x)

('Om',)
('Varun',)

## Create a Python program to delete employees whose experience is less than 5 years (probation not completed). Assume suitable table structure.

In [10]:
cur.execute("select * from emp_details")

result = cur.fetchall()

for x in result:
    print(x)

(1, 'Om', 60500, 22)
(2, 'Vivek', 48000, 18)
(3, 'Neel', 35000, 4)
(4, 'Varun', 66000, 25)
(5, 'Shubham', 28000, 2)
(6, 'Ruthwik', 45000, 12)
(7, 'Rohan', 38000, 6)

In [11]:
cur.execute("delete from emp_details where experiennce < 5")
conn.commit()

In [12]:
cur.execute("select * from emp_details")

result = cur.fetchall()

for x in result:
    print(x)

(1, 'Om', 60500, 22)
(2, 'Vivek', 48000, 18)
(4, 'Varun', 66000, 25)
(6, 'Ruthwik', 45000, 12)
(7, 'Rohan', 38000, 6)

## Create a Python program to add a 5% bonus to employees whose salary is less than 40,000. Assume suitable table structure.

In [13]:
cur.execute("update emp_details set salary = (salary + salary * 0.5) where salary < 40000")
conn.commit()

In [14]:
cur.execute("select * from emp_details")

result = cur.fetchall()

for x in result:
    print(x)

(1, 'Om', 60500, 22)
(2, 'Vivek', 48000, 18)
(4, 'Varun', 66000, 25)
(6, 'Ruthwik', 45000, 12)
(7, 'Rohan', 57000, 6)